#Код написал: Бадерко Макар
#Задание номер 1 из презенташки "Тестовое задание"! 
#Код  написан на Python 3.7.4
#Создаем и получаем переменные для первого и второго числа
f = int(input())
s = int(input())
#Выводим их сумму
print(f + s)

