#Код написал: Бадерко Макар
#Задание номер 3 из презенташки "Тестовое задание"! 
#Код  написан на Python 3.7.4
#Получаем три числа и выводим наибольшее из них
print(max(int(input()), int(input()), int(input())))

