#Код написал: Бадерко Макар
#Задание номер 1 из презенташки "Тестовое задание"! 
#Код  написан на Python 3.7.4
#Выводим сумму двух входов
print(int(input()) + int(input()))